@soumik612 

I Just verified with Hashicorp release binary (v1.1.2) about issue, but looks fix is available in same. could please cross verify on the release version as below highlighted lines
 
 
HYD-ML-00064448:terraform-provider-bigip-1.12 chinthalapalli$ terraform apply
2020/04/29 21:03:49 [INFO] Terraform version: 0.12.12 
2020/04/29 21:03:49 [INFO] Go runtime version: go1.12.9
2020/04/29 21:03:49 [INFO] CLI args: []string{"/usr/local/bin/terraform", "apply"}
2020/04/29 21:03:49 [DEBUG] Attempting to open CLI config file: /Users/chinthalapalli/.terraformrc
2020/04/29 21:03:49 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2020/04/29 21:03:49 [INFO] CLI command args: []string{"apply"}
2020/04/29 21:03:49 [DEBUG] New state was assigned lineage "1b3319ca-66fd-4593-30e4-1cb33692ccbf"
2020/04/29 21:03:49 [TRACE] Meta.Backend: using default local state only (no backend configuration, and no existing initialized backend)
2020/04/29 21:03:49 [DEBUG] checking for provider in "."
2020/04/29 21:03:49 [DEBUG] checking for provider in "/usr/local/bin"
2020/04/29 21:03:49 [DEBUG] checking for provider in ".terraform/plugins/darwin_amd64"
2020/04/29 21:03:49 [DEBUG] found provider "terraform-provider-bigip_v1.1.2_x4"
2020/04/29 21:03:49 [DEBUG] **found valid plugin: "bigip", "1.1.2", "/Users/chinthalapalli/Downloads/terraform-provider-bigip-1.12/.terraform/plugins/darwin_amd64/terraform-provider-bigi
p_v1.1.2_x4"**
 
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
2020/04/29 21:03:51 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  + create
 
Terraform will perform the following actions:
 
  # bigip_ltm_monitor.monitor will be created
  + resource "bigip_ltm_monitor" "monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + database       = "postgres"
      + destination    = (known after apply)
      + id             = (known after apply)
      + interval       = 999
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/terraform_monitor"
      + parent         = "/Common/http"
      + reverse        = (known after apply)
      + send           = "GET /some/path\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 999
      + transparent    = (known after apply)
    }
 
Plan: 1 to add, 0 to change, 0 to destroy.
 
Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
 
  Enter a value: yes
 
2020/04/29 21:03:53 [INFO] backend/local: apply calling Apply
2020/04/29 21:03:53 [INFO] terraform: building graph: GraphTypeApply
 
2020-04-29T21:03:53.847+0530 [DEBUG] plugin.terraform-provider-bigip_v1.1.2_x4: 2020/04/29 21:03:53 [INFO] Initializing BigIP connection
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
